In [5]:
%load_ext sql

In [6]:
 import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [8]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
USER,
PASSWORD,
POSTGRESQL_HOST,
DBASE_NAME
)

In [9]:
%%sql $CONNECT_DATA
SELECT ticket_no, COUNT(flight_id)
FROM Ticket_flights
GROUP BY ticket_no
HAVING COUNT(flight_id) > 3
LIMIT 10;

10 rows affected.

[('0005432312163', 4),
 ('0005432312164', 4),
 ('0005432312165', 4),
 ('0005432312166', 4),
 ('0005432312167', 4),
 ('0005432312168', 4),
 ('0005432312169', 4),
 ('0005432312170', 4),
 ('0005432312171', 4),
 ('0005432312172', 4)]

In [10]:
%%sql

SELECT COUNT(*) AS five_flights
FROM (
SELECT ticket_no
FROM Ticket_Flights
GROUP BY ticket_no
HAVING COUNT(flight_id) = 5
) AS five_flights

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[(54,)]

In [11]:
%%sql postgresql:///jovyan
SELECT * FROM pg_database

4 rows affected.

[(13761, 'postgres', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (16385, 'jovyan', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'C.UTF-8', 'C.UTF-8', True, True, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13760, 'template0', 10, 6, 'C.UTF-8', 'C.UTF-8', True, False, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}')]

In [12]:
%%sql postgresql:///jovyan
CREATE TABLE Eemployees (
EMPLOYEE_ID INT PRIMARY KEY,
FIRST_NAME VARCHAR(30),
LAST_NAME VARCHAR(30),
HIRE_DATE DATE,
JOB_ID VARCHAR(20),
MANAGER_ID INT,
DEPARTMENT_ID SMALLINT
);
INSERT INTO Eemployees (EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE, JOB_ID, MANAGER_ID, DEPARTMENT_ID) VALUES
(100, 'Steven', 'King', '1987-06-17', 'AD_PRES', 0, 90),
(101, 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', 100, 90),
(102, 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
(103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
(107, 'Diana', 'Lorentz', '1987-06-24', 'IT_PROG', 103, 60),
(108, 'Nancy', 'Greenberg', '1987-06-25', 'FI_MGR', 101, 100),
(109, 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
(114, 'Den', 'Raphaely', '1987-07-01', 'PU_MAN', 100, 30),
(118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 30),
(144, 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', 114, 50),
(145, 'John', 'Russell', '1987-08-01', 'SA_MAN', 100, 80),
(146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80);

Done.
12 rows affected.

[]

In [13]:
%%sql postgresql:///jovyan
SELECT *
FROM Eemployees

12 rows affected.

[(100, 'Steven', 'King', datetime.date(1987, 6, 17), 'AD_PRES', 0, 90),
 (101, 'Neena', 'Kochhar', datetime.date(1987, 6, 18), 'AD_VP', 100, 90),
 (102, 'Lex', 'DeHaan', datetime.date(1987, 6, 19), 'AD_VP', 100, 90),
 (103, 'Alexander', 'Hunold', datetime.date(1987, 6, 20), 'IT_PROG', 102, 60),
 (107, 'Diana', 'Lorentz', datetime.date(1987, 6, 24), 'IT_PROG', 103, 60),
 (108, 'Nancy', 'Greenberg', datetime.date(1987, 6, 25), 'FI_MGR', 101, 100),
 (109, 'Daniel', 'Faviet', datetime.date(1987, 6, 26), 'FI_ACCOUNT', 108, 100),
 (114, 'Den', 'Raphaely', datetime.date(1987, 7, 1), 'PU_MAN', 100, 30),
 (118, 'Guy', 'Himuro', datetime.date(1987, 7, 5), 'PU_CLERK', 114, 30),
 (144, 'Peter', 'Vargas', datetime.date(1987, 7, 31), 'ST_CLERK', 114, 50),
 (145, 'John', 'Russell', datetime.date(1987, 8, 1), 'SA_MAN', 100, 80),
 (146, 'Karen', 'Partners', datetime.date(1987, 8, 2), 'SA_MAN', 100, 80)]

In [14]:
%%sql postgresql:///jovyan
CREATE TABLE Departments (
DEPARTMENT_ID SMALLINT PRIMARY KEY,
DEPARTMENT_NAME VARCHAR(50),
MANAGER_ID INT
);
INSERT INTO Departments (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID) VALUES
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205);

Done.
10 rows affected.

[]

In [15]:
%%sql postgresql:///jovyan
SELECT *
FROM Departments

10 rows affected.

[(10, 'Administration', 200),
 (30, 'Purchasing', 114),
 (40, 'HumanResources', 203),
 (50, 'Shipping', 121),
 (60, 'IT', 103),
 (70, 'PublicRelations', 204),
 (80, 'Sales', 145),
 (90, 'Executive', 100),
 (100, 'Finance', 108),
 (110, 'Accounting', 205)]

In [16]:
%%sql postgresql:///jovyan
SELECT department_name AS department, first_name AS name, last_name AS surname
FROM Departments
JOIN Eemployees USING (department_id)
ORDER BY hire_date
LIMIT 1

1 rows affected.

[('Executive', 'Steven', 'King')]

In [20]:
%%sql postgresql:///jovyan
SELECT department_name AS department
FROM Departments
JOIN Eemployees USING (department_id)
ORDER BY department_name

12 rows affected.

[('Executive',),
 ('Executive',),
 ('Executive',),
 ('Finance',),
 ('Finance',),
 ('IT',),
 ('IT',),
 ('Purchasing',),
 ('Purchasing',),
 ('Sales',),
 ('Sales',),
 ('Shipping',)]